# -*- coding: utf-8 -*-
"""Д/З Дывак

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/15heX2pwCQqWUVrWyQsa0Kq_-hnfXt0Yh

Исправляю решение задачи 1.1
"""

from posixpath import join
my_favorite_songs = ["Waste a Moment", "Staying\' Alive", "A Sorta Fairytale", "Start Me Up", "New Salvation"]
my_favorite_songs_str = ''.join(my_favorite_songs)
print (my_favorite_songs_str[0:13],  my_favorite_songs_str[56:69],  my_favorite_songs_str[14:28],  my_favorite_songs_str[45:56])

"""Задача 1.3."""

calendar = [
    ['январь', 31], ['февраль', 28], ['март', 31], ['апрель', 30], ['май', 31], 
    ['июнь', 30], ['июль', 31], ['август', 31], ['сентябрь', 30], ['октябрь', 31], 
    ['ноябрь', 30], ['декабрь', 31]
    ]
month=int(input(' Введите номер месяца:'))
a=month-1
if a>=12 or a<0:
  print('Такого месяца нет!')
else:
  print(f'Вы ввели {calendar[a][0]}', end='. ') 
  print(f'{calendar[a][1]} дней')

"""Задача 2.1."""

privet=[4,6,2,1,9,63,-134,566]  
privet_cpy = privet.copy()
del privet[0]
del privet_cpy[1:8]
a=int(''.join(str(i) for i in privet_cpy)) #a-max b-min
b=a
for x in privet:
  if a<x:
    a=x
  if b>x:
    b=x
print('max =', a, ',min =', b)

""" Задача 2.2. """

calendar = [
    ['январь', 31], ['февраль', 28], ['март', 31], ['апрель', 30], ['май', 31], 
    ['июнь', 30], ['июль', 31], ['август', 31], ['сентябрь', 30], ['октябрь', 31], 
    ['ноябрь', 30], ['декабрь', 31]
    ]
month=int(input(' Введите номер месяца:'))
a=month-1
if a<=2 or a==12:
  print('месяц', month, f'({calendar[a][0]}) является частью первого квартала' )
elif 3<=a<=5:
  print('месяц', month, f'({calendar[a][0]}) является частью второго квартала' )
elif 6<=a<=8:
  print('месяц', month, f'({calendar[a][0]}) является частью третьего квартала' )
elif 9<=a<=11:
  print('месяц', month, f'({calendar[a][0]}) является частью четвертого квартала' )