# -*- coding: utf-8 -*-
"""task 1.3

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1gJ9qj2XKDol6oSw6Em2TnGI7jikUJvSp

Задача 1.3
"""

calendar = [
    ['январь', 31], ['февраль', 28], ['март', 31], ['апрель', 30], ['май', 31], 
    ['июнь', 30], ['июль', 31], ['август', 31], ['сентябрь', 30], ['октябрь', 31], 
    ['ноябрь', 30], ['декабрь', 31]
    ]
month=int(input(' Введите номер месяца:'))
a=month-1
if a>=12 or a<0:
  print('Такого месяца нет!')
else:
  print(f'Вы ввели {calendar[a][0]}', end='. ') 
  print(f'{calendar[a][1]} дней')